"""
现有字典：
dict1 = {'赵小明': '13299887777', '特明朗': '814666888', '普希京': '522888666', '吴小京': '13999887777'}
尝试向其中加入一个键值对，键和值在两行里输入，如果输入的键在字典中已经存在，则输出“您输入的姓名在通讯录中已存在”，如输入的键在字典中不存在则把键和值加入到字典中。操作完成后输出字典中所有键值对。

输入格式
输入有两行，第一行是要加入的姓名，第二行是电话号码

输出格式
参考输入输出示例

示例 1
输入:
普希京
8589995566
输出:
您输入的姓名在通讯录中已存在

示例 2
输入:
成龙
8508887777
输出:

赵小明:13299887777
特明朗:814666888
普希京:522888666
吴小京:13999887777
成龙:8508887777
"""
dict1 = {'赵小明': '13299887777', '特明朗': '814666888', '普希京': '522888666', '吴小京': '13999887777'}
s1 = input()
if s1 in dict1:
    print("您输入的姓名在通讯录中已存在")
    exit()
dict1[s1] = input()
for k,v in dict1.items():
    print(f"{k}:{v}")